@extends('base')

@section('content')
    <div class="col-9" style="font-size: 1.3rem;">
        <p>Мы начнём наше путешествие у стен Старого замка в Гродно. Я расскажу вам одну из легенд об основании этого
            города. </p>
        <p>Однажды в купальскую ночь на берегу реки русалки увидели молодого парня Рустье. Он искал место, чтобы
            поселиться со своими родичами. Русалки закружили его в своём хороводе, защекотали… И погиб бы Рустье, если
            бы не одна из русалок. Звали её Городничанка.</p>
        <p>Понравилась русалка молодому парню. Загорелся огонь в груди. Только Стрибог, бог ветра, мог снять с неё чары,
            но для этого ему нужно было выполнить задания хитрого Стрибога. Приказал царь ветра принести Рустье
            бессмертную траву <a
                    href="https://azbyka.ru/zdorovie/pizhma-poleznye-svojstva-i-protivopokazaniya">пижму</a>.</p>
        <p>Обрадовалась русалка, потому что знала, как помочь своему возлюбленному. Подсказала, как пройти к Купальскому
            дедку, в лукошке которого была эта трава. Дедушка попросил Рустье решить загадку. И крепка-накрепко наказал
            запомнить, что на ней изображено. Помогите решить эту загадку юноше, запомните и вы, что изображено на
            рисунке.</p>
        <br>
        <center><a href="http://www.flash-gear.com/index.php?puz"><img src="http://www.flash-gear.com/puz1.gif"></a><br>
            <EMBED allowScriptAccess="always" allowNetworking="all"
                   src="http://four.flash-gear.com/npuz/puz.php?c=f&o=1&id=4124549&k=32742370&s=150&w=600&h=450"
                   quality=high wmode=transparent scale=noscale salign=LT bgcolor="FFFFFF" WIDTH="750" HEIGHT="600"
                   NAME="puz47709" ALIGN="" TYPE="application/x-shockwave-flash"
                   PLUGINSPAGE="http://www.macromedia.com/go/getflashplayer"/>
            <BR><a href="http://www.flash-gear.com/index.php?puz"><img
                        src="http://www.flash-gear.com/puz2.gif"><br><b><font face="Verdana"><h5>provided by
                            flash-gear.com</h5></font></b></a><br></center>
        <br>

        <p>Не простая оказалась трава пижма, могла открыть любые клады. Помогла открыть и двери во дворец Стрибога.
            Только не захотел царь отпускать Городничанку. Придумал новое задание.</p>
        <p>- Иди туда, где Неман узкий, там волки и медведи его перепрыгивают. Чернобог бросил там камень. Избавь реку
            от этого камня и приходи за русалкой. Знал Стрибог, что человеку не сдвинуть этот камень. Когда нашёл Рустье
            камень, два дня его обходил. Как же сдвинуть эту гору? И тогда стал копать под камнем. </p>
        <img class="img-fluid" src="{{ asset('img/stoun.png') }}" alt="stoun">

        <iframe class="mt-5" src="{{ asset('games/grodno/grodno1/index.html') }}"></iframe>

        <p class="mt-3">Рустье выкопал яму. И провалился камень в эту яму. Свободно побежала неманская река.</p>
        <p>Вернулся Рустье к Стрибогу. А тот придумал новое задание. Выкопать у трёх дубов глубокий колодец.</p>
        <p>- Нужно копать до третьей воды. Первая-мертвая, вторая-не живая, ни мертвая, только третья-живая.</p>
        <p>Нашел юноша три дуба. А по дороге веточку травы <a
                    href="https://ru.wikipedia.org/wiki/%D0%94%D0%B5%D0%B2%D1%8F%D1%81%D0%B8%D0%BB">девятисил</a>
            сорвал.</p>
        <p>Никогда не видать бы любимой Рустье, если бы не целебная трава. Хлынула мёртвая вода- но не смогла одолеть
            силу волшебной травы. Копает Рустье дальше. </p>
        <p>Долго копал юноша. Наконец-то докопался до второй воды. Она лениво потекла. И, наконец-то, появилась живая
            вода. Расцвело и повеселело всё. Позже, когда пришли сюда люди, назвали это место <a
                    href="https://ethno-tour.grsu.by/ru/ethnic-tourism-sights-by/nature-sights/123-kolodezhnyj-rov-prinemanskij-ovrag ">Колодежным
                рвом?</a></p>
        <p>Теперь это памятник природы республиканского значения.</p>
        <p>Уставший Рустье снова явился перед богом ветра. А тот выкручивался как мог. Тогда юноша поднял над головой
            Купальский цветок, который мог раскрыть все сокровища Стрибога. И тому ничего не оставалось, как превратить
            русалочку в прекрасную девушку.</p>
        <p>Остались жить Городничанка и Рустье на высоком береге Немана. Небольшая речка Городничанка текла тут же.
            Торговцы разнесли по миру название этого поселения- Городничанка: то ли имя первой хозяйки, то ли имя
            речки.</p>
        <p>Приходили люди, охочие до чужого добра. Тогда Рустье с мужчинами построили высокий забор с башнями. Не
            каждому они открывали тяжёлые ворота, защищаясь от врагов.</p>
        <p>Так и появился в городе над Неманом один из самых старых замков Беларуси, который в течение веков не раз
            горел и достраивался. Но до сих пор является символом города.</p>
        <p style="color: #1d68a7">Город знает много легенд. Чтобы продолжить наше путешествие, вы познакомитесь еще с
            одной легендой. Выполнив задание, узнаете ключевое
            слово и продолжите путь.</p>
        <iframe src="https://learningapps.org/watch?v=p4j0oebba18" style="border:0px;width:100%;height:500px"
                webkitallowfullscreen="true" mozallowfullscreen="true"></iframe>
        <p>В 1398 году Старый замок пережил сильный пожар, в котором едва не сгорел Великий князь Литовский Витовт со
            всей своей семьей. В один из дней, когда на небе только разгоралась заря, все в замке крепко спали. Но
            кто-то решился избавиться от князя Витовта и сотворил страшное дело: устроил в замке поджёг. И только
            маленькая ручная обезьянка не спала на рассвете, она увидела зарево и истошно кричала, бросилась к князю.
            Князь проснулся и разбудил слуг. Слуги кланялись и благодарили князя за спасение. Сам же замок, а также
            дворец на его территории полностью сгорели. Во многом из-за этого пожара Витовт приказал перестроить замок,
            но на этот раз не использовать деревянные укрепления. Так началась вторая жизнь Старого замка в Гродно.</p>
    </div>
    @if( app('request')->input('word') == 'князь')
        <div class="container mt-3 mb-4">
            <div class="d-flex justify-content-center">
                <a href="{{ route('legendOfLydaCastle') }}" type="button" class="btn btn-primary btn-lg ">Ура, у нас
                    есть еще один ключ!</a>
            </div>
        </div>
    @else
        <div class="container d-flex justify-content-center mt-4 mb-4">
            <div class="col-6">
                <h3 class="mt-2 d-flex justify-content-center">Введите ключевое слово, и продолжите путешествие</h3>
                <form action="" method="get" class="d-flex justify-content-center">
                    <input class="form-control mt-2" type="text" name="word" placeholder="Ключевое слово">
                    <input class="btn btn-primary mt-2" type="submit" value="Ввести">
                </form>
            </div>
        </div>
    @endif
@endsection